raxwinrm/winrm_commands/openshell.xml

<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
        xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <wsa:To>
            {{ uri }}
        </wsa:To>
        <wsman:ResourceURI s:mustUnderstand="true">
            http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd
        </wsman:ResourceURI>
        <wsa:ReplyTo>
            <wsa:Address s:mustUnderstand="true">
                http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
            </wsa:Address>
        </wsa:ReplyTo>
        <wsa:Action s:mustUnderstand="true">
            http://schemas.xmlsoap.org/ws/2004/09/transfer/Create
        </wsa:Action>
        <wsman:MaxEnvelopeSize s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize>
        <wsa:MessageID>uuid:{{ message_id }}</wsa:MessageID>
        <wsman:Locale xml:lang="en-US" s:mustUnderstand="false"/>
        <wsman:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <wsman:Option Name="WINRS_NOPROFILE">TRUE</wsman:Option>
            <wsman:Option Name="WINRS_CODEPAGE">437</wsman:Option>
        </wsman:OptionSet>
        <wsman:OperationTimeout>PT60.000S</wsman:OperationTimeout>
    </s:Header>
    <s:Body>
        <rsp:Shell
                xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
            {%- if environ_var is defined and environ_var.items() %}
            <rsp:Environment>
                {%- for name in environ_var.items() %}
                <rsp:Variable Name="{{ name.0 }}">{{ name.1 }}</rsp:Variable>
                {%- endfor %}
            </rsp:Environment>
            {%- endif %}
            <rsp:WorkingDirectory>{{ work_dir }}</rsp:WorkingDirectory>
            <rsp:IdleTimeout>PT{{ idle_timeout }}.000S</rsp:IdleTimeout>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
        </rsp:Shell>
    </s:Body>
</s:Envelope>